online-throughput/k7/tp-results-eagle3/bench-eagle3-c8.log
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f7bdf1a56c0>, seed=0, num_prompts=80, dataset_name='hf', no_stream=False, dataset_path='likaixin/InstructCoder', no_oversample=False, skip_chat_template=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', base_url=None, host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=8, model='meta-llama/Llama-3.3-70B-Instruct', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=8.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=0, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-c8df4fae-', top_p=1.0, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=600, extra_body=None)
Starting initial single prompt test run...
Waiting for endpoint to become up in 600 seconds
Initial test run completed.
Starting main benchmark run...
Traffic request rate: 8.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 8
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     80        
Failed requests:                         0         
Maximum request concurrency:             8         
Request rate configured (RPS):           8.00      
Benchmark duration (s):                  29.73     
Total input tokens:                      13731     
Total generated tokens:                  11508     
Request throughput (req/s):              2.69      
Output token throughput (tok/s):         387.08    
Peak output token throughput (tok/s):    128.00    
Peak concurrent requests:                13.00     
Total token throughput (tok/s):          848.93    
---------------Time to First Token----------------
Mean TTFT (ms):                          213.54    
Median TTFT (ms):                        212.43    
P99 TTFT (ms):                           261.19    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          17.35     
Median TPOT (ms):                        16.03     
P99 TPOT (ms):                           28.35     
---------------Inter-token Latency----------------
Mean ITL (ms):                           64.51     
Median ITL (ms):                         61.13     
P99 ITL (ms):                            109.97    
---------------Speculative Decoding---------------
Acceptance rate (%):                     39.13     
Acceptance length:                       3.74      
Drafts:                                  3087      
Draft tokens:                            21609     
Accepted tokens:                         8455      
Per-position acceptance (%):
  Position 0:                            74.64     
  Position 1:                            57.40     
  Position 2:                            44.02     
  Position 3:                            33.69     
  Position 4:                            26.50     
  Position 5:                            20.96     
  Position 6:                            16.68     
==================================================